src/cfe/ТестовоеРасширение/Catalogs/ТР_ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ТР_ВидыТарифов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ТестовоеРасширение/HTTPServices/ТР_ТестовыйСервис/Ext/Module.bsl
// Описание АПИ: https://app.swaggerhub.com/apis-docs/vasdmi666/test_task_1/1.0.0

Функция TariffTypesGET(Запрос)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТР_ВидыТарифов.Ссылка КАК Ссылка,
	|	ТР_ВидыТарифов.Наименование КАК Наименование,
	|	ТР_ВидыТарифов.Комментарий КАК Комментарий,
	|	ТР_ВидыТарифов.Стоимость КАК Стоимость
	|ИЗ
	|	Справочник.ТР_ВидыТарифов КАК ТР_ВидыТарифов
	|ГДЕ
	|	НЕ ТР_ВидыТарифов.ПометкаУдаления");
	
	ВыборкаТарифов = Запрос.Выполнить().Выбрать();
	
	МассивДанных = Новый Массив();
	
	Пока ВыборкаТарифов.Следующий() Цикл
		
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("id", XMLСтрока(ВыборкаТарифов.Ссылка));
		СтруктураСтроки.Вставить("name", ВыборкаТарифов.Наименование);
		СтруктураСтроки.Вставить("description", ВыборкаТарифов.Комментарий);
		СтруктураСтроки.Вставить("price", ВыборкаТарифов.Стоимость);
		
		МассивДанных.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивДанных);
	
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(
		ТелоОтвета,
		КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции
